Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/component/spi_ixs.h
#define SPI_IXS_FRAMECTRL_FRMSYPW_Pos         _UINT32_(0)                                          /* (SPI_IXS_FRAMECTRL) Frame sync pulse width in serial words Position */
#define SPI_IXS_FRAMECTRL_FRMSYPW_Msk         (_UINT32_(0xF) << SPI_IXS_FRAMECTRL_FRMSYPW_Pos)     /* (SPI_IXS_FRAMECTRL) Frame sync pulse width in serial words Mask */
#define SPI_IXS_FRAMECTRL_FRMSYPW(value)      (SPI_IXS_FRAMECTRL_FRMSYPW_Msk & (_UINT32_(value) << SPI_IXS_FRAMECTRL_FRMSYPW_Pos)) /* Assigment of value for FRMSYPW in the SPI_IXS_FRAMECTRL register */
#define   SPI_IXS_FRAMECTRL_FRMSYPW_SYPW0_Val _UINT32_(0x0)                                        /* (SPI_IXS_FRAMECTRL) Frame sync pulse is one clock wide  */
#define   SPI_IXS_FRAMECTRL_FRMSYPW_SYPW1_Val _UINT32_(0x1)                                        /* (SPI_IXS_FRAMECTRL) Frame sync pulse is one slots wide  */
#define   SPI_IXS_FRAMECTRL_FRMSYPW_SYPW2_Val _UINT32_(0x2)                                        /* (SPI_IXS_FRAMECTRL) Frame sync pulse is two slots wide  */
#define   SPI_IXS_FRAMECTRL_FRMSYPW_SYPW3_Val _UINT32_(0x3)                                        /* (SPI_IXS_FRAMECTRL) Frame sync pulse is three slots wide  */
#define   SPI_IXS_FRAMECTRL_FRMSYPW_SYPW4_Val _UINT32_(0x4)                                        /* (SPI_IXS_FRAMECTRL) Frame sync pulse is four slots wide  */
#define   SPI_IXS_FRAMECTRL_FRMSYPW_SYPW5_Val _UINT32_(0x5)                                        /* (SPI_IXS_FRAMECTRL) Frame sync pulse is five slots wide  */
#define   SPI_IXS_FRAMECTRL_FRMSYPW_SYPW6_Val _UINT32_(0x6)                                        /* (SPI_IXS_FRAMECTRL) Frame sync pulse is six slots wide  */
#define   SPI_IXS_FRAMECTRL_FRMSYPW_SYPW7_Val _UINT32_(0x7)                                        /* (SPI_IXS_FRAMECTRL) Frame sync pulse is seven slots wide  */
#define   SPI_IXS_FRAMECTRL_FRMSYPW_SYPW8_Val _UINT32_(0x8)                                        /* (SPI_IXS_FRAMECTRL) Frame sync pulse is eight slots wide  */
#define   SPI_IXS_FRAMECTRL_FRMSYPW_SYPW16_Val _UINT32_(0x9)                                        /* (SPI_IXS_FRAMECTRL) Frame sync pulse is sixteen slots wide  */
#define   SPI_IXS_FRAMECTRL_FRMSYPW_SYPW31_Val _UINT32_(0xA)                                        /* (SPI_IXS_FRAMECTRL) Frame sync pulse is thirty one slots wide  */
#define SPI_IXS_FRAMECTRL_FRMSYPW_SYPW0       (SPI_IXS_FRAMECTRL_FRMSYPW_SYPW0_Val << SPI_IXS_FRAMECTRL_FRMSYPW_Pos) /* (SPI_IXS_FRAMECTRL) Frame sync pulse is one clock wide Position  */
#define SPI_IXS_FRAMECTRL_FRMSYPW_SYPW1       (SPI_IXS_FRAMECTRL_FRMSYPW_SYPW1_Val << SPI_IXS_FRAMECTRL_FRMSYPW_Pos) /* (SPI_IXS_FRAMECTRL) Frame sync pulse is one slots wide Position  */
#define SPI_IXS_FRAMECTRL_FRMSYPW_SYPW2       (SPI_IXS_FRAMECTRL_FRMSYPW_SYPW2_Val << SPI_IXS_FRAMECTRL_FRMSYPW_Pos) /* (SPI_IXS_FRAMECTRL) Frame sync pulse is two slots wide Position  */
#define SPI_IXS_FRAMECTRL_FRMSYPW_SYPW3       (SPI_IXS_FRAMECTRL_FRMSYPW_SYPW3_Val << SPI_IXS_FRAMECTRL_FRMSYPW_Pos) /* (SPI_IXS_FRAMECTRL) Frame sync pulse is three slots wide Position  */
#define SPI_IXS_FRAMECTRL_FRMSYPW_SYPW4       (SPI_IXS_FRAMECTRL_FRMSYPW_SYPW4_Val << SPI_IXS_FRAMECTRL_FRMSYPW_Pos) /* (SPI_IXS_FRAMECTRL) Frame sync pulse is four slots wide Position  */
#define SPI_IXS_FRAMECTRL_FRMSYPW_SYPW5       (SPI_IXS_FRAMECTRL_FRMSYPW_SYPW5_Val << SPI_IXS_FRAMECTRL_FRMSYPW_Pos) /* (SPI_IXS_FRAMECTRL) Frame sync pulse is five slots wide Position  */
#define SPI_IXS_FRAMECTRL_FRMSYPW_SYPW6       (SPI_IXS_FRAMECTRL_FRMSYPW_SYPW6_Val << SPI_IXS_FRAMECTRL_FRMSYPW_Pos) /* (SPI_IXS_FRAMECTRL) Frame sync pulse is six slots wide Position  */
#define SPI_IXS_FRAMECTRL_FRMSYPW_SYPW7       (SPI_IXS_FRAMECTRL_FRMSYPW_SYPW7_Val << SPI_IXS_FRAMECTRL_FRMSYPW_Pos) /* (SPI_IXS_FRAMECTRL) Frame sync pulse is seven slots wide Position  */
#define SPI_IXS_FRAMECTRL_FRMSYPW_SYPW8       (SPI_IXS_FRAMECTRL_FRMSYPW_SYPW8_Val << SPI_IXS_FRAMECTRL_FRMSYPW_Pos) /* (SPI_IXS_FRAMECTRL) Frame sync pulse is eight slots wide Position  */
#define SPI_IXS_FRAMECTRL_FRMSYPW_SYPW16      (SPI_IXS_FRAMECTRL_FRMSYPW_SYPW16_Val << SPI_IXS_FRAMECTRL_FRMSYPW_Pos) /* (SPI_IXS_FRAMECTRL) Frame sync pulse is sixteen slots wide Position  */
#define SPI_IXS_FRAMECTRL_FRMSYPW_SYPW31      (SPI_IXS_FRAMECTRL_FRMSYPW_SYPW31_Val << SPI_IXS_FRAMECTRL_FRMSYPW_Pos) /* (SPI_IXS_FRAMECTRL) Frame sync pulse is thirty one slots wide Position  */
#define SPI_IXS_FRAMECTRL_FRMCOINC_Pos        _UINT32_(8)                                          /* (SPI_IXS_FRAMECTRL) Frame Sync Pulse Edge Select bit Position */
#define SPI_IXS_FRAMECTRL_FRMCOINC_Msk        (_UINT32_(0x1) << SPI_IXS_FRAMECTRL_FRMCOINC_Pos)    /* (SPI_IXS_FRAMECTRL) Frame Sync Pulse Edge Select bit Mask */
#define SPI_IXS_FRAMECTRL_FRMCOINC(value)     (SPI_IXS_FRAMECTRL_FRMCOINC_Msk & (_UINT32_(value) << SPI_IXS_FRAMECTRL_FRMCOINC_Pos)) /* Assigment of value for FRMCOINC in the SPI_IXS_FRAMECTRL register */
#define SPI_IXS_FRAMECTRL_FRMPOL_Pos          _UINT32_(13)                                         /* (SPI_IXS_FRAMECTRL) Frame Sync / Slave Select Polarity bit Position */
#define SPI_IXS_FRAMECTRL_FRMPOL_Msk          (_UINT32_(0x1) << SPI_IXS_FRAMECTRL_FRMPOL_Pos)      /* (SPI_IXS_FRAMECTRL) Frame Sync / Slave Select Polarity bit Mask */
#define SPI_IXS_FRAMECTRL_FRMPOL(value)       (SPI_IXS_FRAMECTRL_FRMPOL_Msk & (_UINT32_(value) << SPI_IXS_FRAMECTRL_FRMPOL_Pos)) /* Assigment of value for FRMPOL in the SPI_IXS_FRAMECTRL register */
#define SPI_IXS_FRAMECTRL_FRMSLV_Pos          _UINT32_(14)                                         /* (SPI_IXS_FRAMECTRL) Frame Sync Pulse Direction Control bit Position */
#define SPI_IXS_FRAMECTRL_FRMSLV_Msk          (_UINT32_(0x1) << SPI_IXS_FRAMECTRL_FRMSLV_Pos)      /* (SPI_IXS_FRAMECTRL) Frame Sync Pulse Direction Control bit Mask */
#define SPI_IXS_FRAMECTRL_FRMSLV(value)       (SPI_IXS_FRAMECTRL_FRMSLV_Msk & (_UINT32_(value) << SPI_IXS_FRAMECTRL_FRMSLV_Pos)) /* Assigment of value for FRMSLV in the SPI_IXS_FRAMECTRL register */
#define SPI_IXS_FRAMECTRL_FRMCNT_Pos          _UINT32_(16)                                         /* (SPI_IXS_FRAMECTRL) Frame sync pulse counter Position */
#define SPI_IXS_FRAMECTRL_FRMCNT_Msk          (_UINT32_(0x1F) << SPI_IXS_FRAMECTRL_FRMCNT_Pos)     /* (SPI_IXS_FRAMECTRL) Frame sync pulse counter Mask */
#define SPI_IXS_FRAMECTRL_FRMCNT(value)       (SPI_IXS_FRAMECTRL_FRMCNT_Msk & (_UINT32_(value) << SPI_IXS_FRAMECTRL_FRMCNT_Pos)) /* Assigment of value for FRMCNT in the SPI_IXS_FRAMECTRL register */
#define   SPI_IXS_FRAMECTRL_FRMCNT_CNT1_Val   _UINT32_(0x0)                                        /* (SPI_IXS_FRAMECTRL) Generate a Frame sync pulse on each serial word  */
#define   SPI_IXS_FRAMECTRL_FRMCNT_CNT2_Val   _UINT32_(0x1)                                        /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 2  */
#define   SPI_IXS_FRAMECTRL_FRMCNT_CNT3_Val   _UINT32_(0x2)                                        /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 3  */
#define   SPI_IXS_FRAMECTRL_FRMCNT_CNT4_Val   _UINT32_(0x3)                                        /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 4  */
#define   SPI_IXS_FRAMECTRL_FRMCNT_CNT5_Val   _UINT32_(0x4)                                        /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 5  */
#define   SPI_IXS_FRAMECTRL_FRMCNT_CNT6_Val   _UINT32_(0x5)                                        /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 6  */
#define   SPI_IXS_FRAMECTRL_FRMCNT_CNT8_Val   _UINT32_(0x6)                                        /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 8  */
#define   SPI_IXS_FRAMECTRL_FRMCNT_CNT10_Val  _UINT32_(0x7)                                        /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 10  */
#define   SPI_IXS_FRAMECTRL_FRMCNT_CNT12_Val  _UINT32_(0x8)                                        /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 12  */
#define   SPI_IXS_FRAMECTRL_FRMCNT_CNT14_Val  _UINT32_(0x9)                                        /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 14  */
#define   SPI_IXS_FRAMECTRL_FRMCNT_CNT16_Val  _UINT32_(0xA)                                        /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 16  */
#define   SPI_IXS_FRAMECTRL_FRMCNT_CNT18_Val  _UINT32_(0xB)                                        /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 18  */
#define   SPI_IXS_FRAMECTRL_FRMCNT_CNT20_Val  _UINT32_(0xC)                                        /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 20  */
#define   SPI_IXS_FRAMECTRL_FRMCNT_CNT22_Val  _UINT32_(0xD)                                        /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 22  */
#define   SPI_IXS_FRAMECTRL_FRMCNT_CNT24_Val  _UINT32_(0xE)                                        /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 24  */
#define   SPI_IXS_FRAMECTRL_FRMCNT_CNT26_Val  _UINT32_(0xF)                                        /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 26  */
#define   SPI_IXS_FRAMECTRL_FRMCNT_CNT28_Val  _UINT32_(0x10)                                       /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 28  */
#define   SPI_IXS_FRAMECTRL_FRMCNT_CNT30_Val  _UINT32_(0x11)                                       /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 30  */
#define   SPI_IXS_FRAMECTRL_FRMCNT_CNT32_Val  _UINT32_(0x12)                                       /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 32  */
#define SPI_IXS_FRAMECTRL_FRMCNT_CNT1         (SPI_IXS_FRAMECTRL_FRMCNT_CNT1_Val << SPI_IXS_FRAMECTRL_FRMCNT_Pos) /* (SPI_IXS_FRAMECTRL) Generate a Frame sync pulse on each serial word Position  */
#define SPI_IXS_FRAMECTRL_FRMCNT_CNT2         (SPI_IXS_FRAMECTRL_FRMCNT_CNT2_Val << SPI_IXS_FRAMECTRL_FRMCNT_Pos) /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 2 Position  */
#define SPI_IXS_FRAMECTRL_FRMCNT_CNT3         (SPI_IXS_FRAMECTRL_FRMCNT_CNT3_Val << SPI_IXS_FRAMECTRL_FRMCNT_Pos) /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 3 Position  */
#define SPI_IXS_FRAMECTRL_FRMCNT_CNT4         (SPI_IXS_FRAMECTRL_FRMCNT_CNT4_Val << SPI_IXS_FRAMECTRL_FRMCNT_Pos) /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 4 Position  */
#define SPI_IXS_FRAMECTRL_FRMCNT_CNT5         (SPI_IXS_FRAMECTRL_FRMCNT_CNT5_Val << SPI_IXS_FRAMECTRL_FRMCNT_Pos) /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 5 Position  */
#define SPI_IXS_FRAMECTRL_FRMCNT_CNT6         (SPI_IXS_FRAMECTRL_FRMCNT_CNT6_Val << SPI_IXS_FRAMECTRL_FRMCNT_Pos) /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 6 Position  */
#define SPI_IXS_FRAMECTRL_FRMCNT_CNT8         (SPI_IXS_FRAMECTRL_FRMCNT_CNT8_Val << SPI_IXS_FRAMECTRL_FRMCNT_Pos) /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 8 Position  */
#define SPI_IXS_FRAMECTRL_FRMCNT_CNT10        (SPI_IXS_FRAMECTRL_FRMCNT_CNT10_Val << SPI_IXS_FRAMECTRL_FRMCNT_Pos) /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 10 Position  */
#define SPI_IXS_FRAMECTRL_FRMCNT_CNT12        (SPI_IXS_FRAMECTRL_FRMCNT_CNT12_Val << SPI_IXS_FRAMECTRL_FRMCNT_Pos) /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 12 Position  */
#define SPI_IXS_FRAMECTRL_FRMCNT_CNT14        (SPI_IXS_FRAMECTRL_FRMCNT_CNT14_Val << SPI_IXS_FRAMECTRL_FRMCNT_Pos) /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 14 Position  */
#define SPI_IXS_FRAMECTRL_FRMCNT_CNT16        (SPI_IXS_FRAMECTRL_FRMCNT_CNT16_Val << SPI_IXS_FRAMECTRL_FRMCNT_Pos) /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 16 Position  */
#define SPI_IXS_FRAMECTRL_FRMCNT_CNT18        (SPI_IXS_FRAMECTRL_FRMCNT_CNT18_Val << SPI_IXS_FRAMECTRL_FRMCNT_Pos) /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 18 Position  */
#define SPI_IXS_FRAMECTRL_FRMCNT_CNT20        (SPI_IXS_FRAMECTRL_FRMCNT_CNT20_Val << SPI_IXS_FRAMECTRL_FRMCNT_Pos) /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 20 Position  */
#define SPI_IXS_FRAMECTRL_FRMCNT_CNT22        (SPI_IXS_FRAMECTRL_FRMCNT_CNT22_Val << SPI_IXS_FRAMECTRL_FRMCNT_Pos) /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 22 Position  */
#define SPI_IXS_FRAMECTRL_FRMCNT_CNT24        (SPI_IXS_FRAMECTRL_FRMCNT_CNT24_Val << SPI_IXS_FRAMECTRL_FRMCNT_Pos) /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 24 Position  */
#define SPI_IXS_FRAMECTRL_FRMCNT_CNT26        (SPI_IXS_FRAMECTRL_FRMCNT_CNT26_Val << SPI_IXS_FRAMECTRL_FRMCNT_Pos) /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 26 Position  */
#define SPI_IXS_FRAMECTRL_FRMCNT_CNT28        (SPI_IXS_FRAMECTRL_FRMCNT_CNT28_Val << SPI_IXS_FRAMECTRL_FRMCNT_Pos) /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 28 Position  */
#define SPI_IXS_FRAMECTRL_FRMCNT_CNT30        (SPI_IXS_FRAMECTRL_FRMCNT_CNT30_Val << SPI_IXS_FRAMECTRL_FRMCNT_Pos) /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 30 Position  */
#define SPI_IXS_FRAMECTRL_FRMCNT_CNT32        (SPI_IXS_FRAMECTRL_FRMCNT_CNT32_Val << SPI_IXS_FRAMECTRL_FRMCNT_Pos) /* (SPI_IXS_FRAMECTRL) Number of slots per frame sync pulse is 32 Position  */
#define SPI_IXS_FRAMECTRL_TDMSSZ_Pos          _UINT32_(24)                                         /* (SPI_IXS_FRAMECTRL) TDM Number of Bits in a Slot Size Position */
#define SPI_IXS_FRAMECTRL_TDMSSZ_Msk          (_UINT32_(0x7) << SPI_IXS_FRAMECTRL_TDMSSZ_Pos)      /* (SPI_IXS_FRAMECTRL) TDM Number of Bits in a Slot Size Mask */
#define SPI_IXS_FRAMECTRL_TDMSSZ(value)       (SPI_IXS_FRAMECTRL_TDMSSZ_Msk & (_UINT32_(value) << SPI_IXS_FRAMECTRL_TDMSSZ_Pos)) /* Assigment of value for TDMSSZ in the SPI_IXS_FRAMECTRL register */
#define   SPI_IXS_FRAMECTRL_TDMSSZ_SLTSZ8_Val _UINT32_(0x0)                                        /* (SPI_IXS_FRAMECTRL) Slot Size 8  */
#define   SPI_IXS_FRAMECTRL_TDMSSZ_SLTSZ12_Val _UINT32_(0x1)                                        /* (SPI_IXS_FRAMECTRL) Slot Size 12  */
#define   SPI_IXS_FRAMECTRL_TDMSSZ_SLTSZ16_Val _UINT32_(0x2)                                        /* (SPI_IXS_FRAMECTRL) Slot Size 16  */
#define   SPI_IXS_FRAMECTRL_TDMSSZ_SLTSZ20_Val _UINT32_(0x3)                                        /* (SPI_IXS_FRAMECTRL) Slot Size 20  */
#define   SPI_IXS_FRAMECTRL_TDMSSZ_SLTSZ24_Val _UINT32_(0x4)                                        /* (SPI_IXS_FRAMECTRL) Slot Size 24  */
#define   SPI_IXS_FRAMECTRL_TDMSSZ_SLTSZ28_Val _UINT32_(0x5)                                        /* (SPI_IXS_FRAMECTRL) Slot Size 28  */
#define   SPI_IXS_FRAMECTRL_TDMSSZ_SLTSZ32_Val _UINT32_(0x6)                                        /* (SPI_IXS_FRAMECTRL) Slot Size 32  */
#define SPI_IXS_FRAMECTRL_TDMSSZ_SLTSZ8       (SPI_IXS_FRAMECTRL_TDMSSZ_SLTSZ8_Val << SPI_IXS_FRAMECTRL_TDMSSZ_Pos) /* (SPI_IXS_FRAMECTRL) Slot Size 8 Position  */
#define SPI_IXS_FRAMECTRL_TDMSSZ_SLTSZ12      (SPI_IXS_FRAMECTRL_TDMSSZ_SLTSZ12_Val << SPI_IXS_FRAMECTRL_TDMSSZ_Pos) /* (SPI_IXS_FRAMECTRL) Slot Size 12 Position  */
#define SPI_IXS_FRAMECTRL_TDMSSZ_SLTSZ16      (SPI_IXS_FRAMECTRL_TDMSSZ_SLTSZ16_Val << SPI_IXS_FRAMECTRL_TDMSSZ_Pos) /* (SPI_IXS_FRAMECTRL) Slot Size 16 Position  */
#define SPI_IXS_FRAMECTRL_TDMSSZ_SLTSZ20      (SPI_IXS_FRAMECTRL_TDMSSZ_SLTSZ20_Val << SPI_IXS_FRAMECTRL_TDMSSZ_Pos) /* (SPI_IXS_FRAMECTRL) Slot Size 20 Position  */
#define SPI_IXS_FRAMECTRL_TDMSSZ_SLTSZ24      (SPI_IXS_FRAMECTRL_TDMSSZ_SLTSZ24_Val << SPI_IXS_FRAMECTRL_TDMSSZ_Pos) /* (SPI_IXS_FRAMECTRL) Slot Size 24 Position  */
#define SPI_IXS_FRAMECTRL_TDMSSZ_SLTSZ28      (SPI_IXS_FRAMECTRL_TDMSSZ_SLTSZ28_Val << SPI_IXS_FRAMECTRL_TDMSSZ_Pos) /* (SPI_IXS_FRAMECTRL) Slot Size 28 Position  */
#define SPI_IXS_FRAMECTRL_TDMSSZ_SLTSZ32      (SPI_IXS_FRAMECTRL_TDMSSZ_SLTSZ32_Val << SPI_IXS_FRAMECTRL_TDMSSZ_Pos) /* (SPI_IXS_FRAMECTRL) Slot Size 32 Position  */
#define SPI_IXS_FRAMECTRL_TDMWSZ_Pos          _UINT32_(29)                                         /* (SPI_IXS_FRAMECTRL) TDM Number of Bits in a Word Size Position */
#define SPI_IXS_FRAMECTRL_TDMWSZ_Msk          (_UINT32_(0x7) << SPI_IXS_FRAMECTRL_TDMWSZ_Pos)      /* (SPI_IXS_FRAMECTRL) TDM Number of Bits in a Word Size Mask */
#define SPI_IXS_FRAMECTRL_TDMWSZ(value)       (SPI_IXS_FRAMECTRL_TDMWSZ_Msk & (_UINT32_(value) << SPI_IXS_FRAMECTRL_TDMWSZ_Pos)) /* Assigment of value for TDMWSZ in the SPI_IXS_FRAMECTRL register */
#define   SPI_IXS_FRAMECTRL_TDMWSZ_WDSZ8_Val  _UINT32_(0x0)                                        /* (SPI_IXS_FRAMECTRL) Word Size 8  */
#define   SPI_IXS_FRAMECTRL_TDMWSZ_WDSZ12_Val _UINT32_(0x1)                                        /* (SPI_IXS_FRAMECTRL) Word Size 12  */
#define   SPI_IXS_FRAMECTRL_TDMWSZ_WDSZ16_Val _UINT32_(0x2)                                        /* (SPI_IXS_FRAMECTRL) Word Size 16  */
#define   SPI_IXS_FRAMECTRL_TDMWSZ_WDSZ20_Val _UINT32_(0x3)                                        /* (SPI_IXS_FRAMECTRL) Word Size 20  */
#define   SPI_IXS_FRAMECTRL_TDMWSZ_WDSZ24_Val _UINT32_(0x4)                                        /* (SPI_IXS_FRAMECTRL) Word Size 24  */
#define   SPI_IXS_FRAMECTRL_TDMWSZ_WDSZ28_Val _UINT32_(0x5)                                        /* (SPI_IXS_FRAMECTRL) Word Size 28  */
#define   SPI_IXS_FRAMECTRL_TDMWSZ_WDSZ32_Val _UINT32_(0x6)                                        /* (SPI_IXS_FRAMECTRL) Word Size 32  */
#define SPI_IXS_FRAMECTRL_TDMWSZ_WDSZ8        (SPI_IXS_FRAMECTRL_TDMWSZ_WDSZ8_Val << SPI_IXS_FRAMECTRL_TDMWSZ_Pos) /* (SPI_IXS_FRAMECTRL) Word Size 8 Position  */
#define SPI_IXS_FRAMECTRL_TDMWSZ_WDSZ12       (SPI_IXS_FRAMECTRL_TDMWSZ_WDSZ12_Val << SPI_IXS_FRAMECTRL_TDMWSZ_Pos) /* (SPI_IXS_FRAMECTRL) Word Size 12 Position  */
#define SPI_IXS_FRAMECTRL_TDMWSZ_WDSZ16       (SPI_IXS_FRAMECTRL_TDMWSZ_WDSZ16_Val << SPI_IXS_FRAMECTRL_TDMWSZ_Pos) /* (SPI_IXS_FRAMECTRL) Word Size 16 Position  */
#define SPI_IXS_FRAMECTRL_TDMWSZ_WDSZ20       (SPI_IXS_FRAMECTRL_TDMWSZ_WDSZ20_Val << SPI_IXS_FRAMECTRL_TDMWSZ_Pos) /* (SPI_IXS_FRAMECTRL) Word Size 20 Position  */
#define SPI_IXS_FRAMECTRL_TDMWSZ_WDSZ24       (SPI_IXS_FRAMECTRL_TDMWSZ_WDSZ24_Val << SPI_IXS_FRAMECTRL_TDMWSZ_Pos) /* (SPI_IXS_FRAMECTRL) Word Size 24 Position  */
#define SPI_IXS_FRAMECTRL_TDMWSZ_WDSZ28       (SPI_IXS_FRAMECTRL_TDMWSZ_WDSZ28_Val << SPI_IXS_FRAMECTRL_TDMWSZ_Pos) /* (SPI_IXS_FRAMECTRL) Word Size 28 Position  */
#define SPI_IXS_FRAMECTRL_TDMWSZ_WDSZ32       (SPI_IXS_FRAMECTRL_TDMWSZ_WDSZ32_Val << SPI_IXS_FRAMECTRL_TDMWSZ_Pos) /* (SPI_IXS_FRAMECTRL) Word Size 32 Position  */
#define SPI_IXS_FRAMECTRL_Msk                 _UINT32_(0xE71F610F)                                 /* (SPI_IXS_FRAMECTRL) Register Mask  */


