Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/component/spi_ixs.h
/* -------- SPI_IXS_INTFLAG : (SPI_IXS Offset: 0x20) (R/W 32) SPI Interrupt Flag Register -------- */
#define SPI_IXS_INTFLAG_RESETVALUE            _UINT32_(0x00)                                       /*  (SPI_IXS_INTFLAG) SPI Interrupt Flag Register  Reset Value */

#define SPI_IXS_INTFLAG_SPIRXBF_Pos           _UINT32_(0)                                          /* (SPI_IXS_INTFLAG) SPI Receive Buffer Full Status Bit Position */
#define SPI_IXS_INTFLAG_SPIRXBF_Msk           (_UINT32_(0x1) << SPI_IXS_INTFLAG_SPIRXBF_Pos)       /* (SPI_IXS_INTFLAG) SPI Receive Buffer Full Status Bit Mask */
#define SPI_IXS_INTFLAG_SPIRXBF(value)        (SPI_IXS_INTFLAG_SPIRXBF_Msk & (_UINT32_(value) << SPI_IXS_INTFLAG_SPIRXBF_Pos)) /* Assigment of value for SPIRXBF in the SPI_IXS_INTFLAG register */
#define SPI_IXS_INTFLAG_SPITXBE_Pos           _UINT32_(4)                                          /* (SPI_IXS_INTFLAG) SPI Transmit Buffer Empty Status Bit Position */
#define SPI_IXS_INTFLAG_SPITXBE_Msk           (_UINT32_(0x1) << SPI_IXS_INTFLAG_SPITXBE_Pos)       /* (SPI_IXS_INTFLAG) SPI Transmit Buffer Empty Status Bit Mask */
#define SPI_IXS_INTFLAG_SPITXBE(value)        (SPI_IXS_INTFLAG_SPITXBE_Msk & (_UINT32_(value) << SPI_IXS_INTFLAG_SPITXBE_Pos)) /* Assigment of value for SPITXBE in the SPI_IXS_INTFLAG register */
#define SPI_IXS_INTFLAG_FRMERR_Pos            _UINT32_(15)                                         /* (SPI_IXS_INTFLAG) SPI Frame Error Status bit Position */
#define SPI_IXS_INTFLAG_FRMERR_Msk            (_UINT32_(0x1) << SPI_IXS_INTFLAG_FRMERR_Pos)        /* (SPI_IXS_INTFLAG) SPI Frame Error Status bit Mask */
#define SPI_IXS_INTFLAG_FRMERR(value)         (SPI_IXS_INTFLAG_FRMERR_Msk & (_UINT32_(value) << SPI_IXS_INTFLAG_FRMERR_Pos)) /* Assigment of value for FRMERR in the SPI_IXS_INTFLAG register */
#define SPI_IXS_INTFLAG_SPITUR_Pos            _UINT32_(27)                                         /* (SPI_IXS_INTFLAG) Transmit Underrun Status bit Position */
#define SPI_IXS_INTFLAG_SPITUR_Msk            (_UINT32_(0x1) << SPI_IXS_INTFLAG_SPITUR_Pos)        /* (SPI_IXS_INTFLAG) Transmit Underrun Status bit Mask */
#define SPI_IXS_INTFLAG_SPITUR(value)         (SPI_IXS_INTFLAG_SPITUR_Msk & (_UINT32_(value) << SPI_IXS_INTFLAG_SPITUR_Pos)) /* Assigment of value for SPITUR in the SPI_IXS_INTFLAG register */
#define SPI_IXS_INTFLAG_SPIROV_Pos            _UINT32_(30)                                         /* (SPI_IXS_INTFLAG) Receive Overflow Status bit Position */
#define SPI_IXS_INTFLAG_SPIROV_Msk            (_UINT32_(0x1) << SPI_IXS_INTFLAG_SPIROV_Pos)        /* (SPI_IXS_INTFLAG) Receive Overflow Status bit Mask */
#define SPI_IXS_INTFLAG_SPIROV(value)         (SPI_IXS_INTFLAG_SPIROV_Msk & (_UINT32_(value) << SPI_IXS_INTFLAG_SPIROV_Pos)) /* Assigment of value for SPIROV in the SPI_IXS_INTFLAG register */
#define SPI_IXS_INTFLAG_Msk                   _UINT32_(0x48008011)                                 /* (SPI_IXS_INTFLAG) Register Mask  */


/* -------- SPI_IXS_STATUS : (SPI_IXS Offset: 0x24) ( R/ 32) SPI Status Register -------- */
#define SPI_IXS_STATUS_RESETVALUE             _UINT32_(0x90000000)                                 /*  (SPI_IXS_STATUS) SPI Status Register  Reset Value */

#define SPI_IXS_STATUS_RXBUFELM_Pos           _UINT32_(0)                                          /* (SPI_IXS_STATUS) Receive Buffer Element Count bits Position */
#define SPI_IXS_STATUS_RXBUFELM_Msk           (_UINT32_(0x1FF) << SPI_IXS_STATUS_RXBUFELM_Pos)     /* (SPI_IXS_STATUS) Receive Buffer Element Count bits Mask */
#define SPI_IXS_STATUS_RXBUFELM(value)        (SPI_IXS_STATUS_RXBUFELM_Msk & (_UINT32_(value) << SPI_IXS_STATUS_RXBUFELM_Pos)) /* Assigment of value for RXBUFELM in the SPI_IXS_STATUS register */
#define SPI_IXS_STATUS_SRMT_Pos               _UINT32_(13)                                         /* (SPI_IXS_STATUS) Register (SR) Empty bit Position */
#define SPI_IXS_STATUS_SRMT_Msk               (_UINT32_(0x1) << SPI_IXS_STATUS_SRMT_Pos)           /* (SPI_IXS_STATUS) Register (SR) Empty bit Mask */
#define SPI_IXS_STATUS_SRMT(value)            (SPI_IXS_STATUS_SRMT_Msk & (_UINT32_(value) << SPI_IXS_STATUS_SRMT_Pos)) /* Assigment of value for SRMT in the SPI_IXS_STATUS register */
#define SPI_IXS_STATUS_SPIBUSY_Pos            _UINT32_(14)                                         /* (SPI_IXS_STATUS) SPI activity status bit Position */
#define SPI_IXS_STATUS_SPIBUSY_Msk            (_UINT32_(0x1) << SPI_IXS_STATUS_SPIBUSY_Pos)        /* (SPI_IXS_STATUS) SPI activity status bit Mask */
#define SPI_IXS_STATUS_SPIBUSY(value)         (SPI_IXS_STATUS_SPIBUSY_Msk & (_UINT32_(value) << SPI_IXS_STATUS_SPIBUSY_Pos)) /* Assigment of value for SPIBUSY in the SPI_IXS_STATUS register */
#define SPI_IXS_STATUS_TXBUFELM_Pos           _UINT32_(16)                                         /* (SPI_IXS_STATUS) Transmit Buffer Element Count bits Position */
#define SPI_IXS_STATUS_TXBUFELM_Msk           (_UINT32_(0x1FF) << SPI_IXS_STATUS_TXBUFELM_Pos)     /* (SPI_IXS_STATUS) Transmit Buffer Element Count bits Mask */
#define SPI_IXS_STATUS_TXBUFELM(value)        (SPI_IXS_STATUS_TXBUFELM_Msk & (_UINT32_(value) << SPI_IXS_STATUS_TXBUFELM_Pos)) /* Assigment of value for TXBUFELM in the SPI_IXS_STATUS register */
#define SPI_IXS_STATUS_SPITBF_Pos             _UINT32_(26)                                         /* (SPI_IXS_STATUS) SPI Transmit Buffer Full Status bit Position */
#define SPI_IXS_STATUS_SPITBF_Msk             (_UINT32_(0x1) << SPI_IXS_STATUS_SPITBF_Pos)         /* (SPI_IXS_STATUS) SPI Transmit Buffer Full Status bit Mask */
#define SPI_IXS_STATUS_SPITBF(value)          (SPI_IXS_STATUS_SPITBF_Msk & (_UINT32_(value) << SPI_IXS_STATUS_SPITBF_Pos)) /* Assigment of value for SPITBF in the SPI_IXS_STATUS register */
#define SPI_IXS_STATUS_SPITBE_Pos             _UINT32_(28)                                         /* (SPI_IXS_STATUS) SPI Transmit Buffer Empty status bit Position */
#define SPI_IXS_STATUS_SPITBE_Msk             (_UINT32_(0x1) << SPI_IXS_STATUS_SPITBE_Pos)         /* (SPI_IXS_STATUS) SPI Transmit Buffer Empty status bit Mask */
#define SPI_IXS_STATUS_SPITBE(value)          (SPI_IXS_STATUS_SPITBE_Msk & (_UINT32_(value) << SPI_IXS_STATUS_SPITBE_Pos)) /* Assigment of value for SPITBE in the SPI_IXS_STATUS register */
#define SPI_IXS_STATUS_SPIRBF_Pos             _UINT32_(29)                                         /* (SPI_IXS_STATUS) SPI Receive Buffer Full status bit Position */
#define SPI_IXS_STATUS_SPIRBF_Msk             (_UINT32_(0x1) << SPI_IXS_STATUS_SPIRBF_Pos)         /* (SPI_IXS_STATUS) SPI Receive Buffer Full status bit Mask */
#define SPI_IXS_STATUS_SPIRBF(value)          (SPI_IXS_STATUS_SPIRBF_Msk & (_UINT32_(value) << SPI_IXS_STATUS_SPIRBF_Pos)) /* Assigment of value for SPIRBF in the SPI_IXS_STATUS register */
#define SPI_IXS_STATUS_SPIRBE_Pos             _UINT32_(31)                                         /* (SPI_IXS_STATUS) RX Buffer Empty bit Position */
#define SPI_IXS_STATUS_SPIRBE_Msk             (_UINT32_(0x1) << SPI_IXS_STATUS_SPIRBE_Pos)         /* (SPI_IXS_STATUS) RX Buffer Empty bit Mask */
#define SPI_IXS_STATUS_SPIRBE(value)          (SPI_IXS_STATUS_SPIRBE_Msk & (_UINT32_(value) << SPI_IXS_STATUS_SPIRBE_Pos)) /* Assigment of value for SPIRBE in the SPI_IXS_STATUS register */
#define SPI_IXS_STATUS_Msk                    _UINT32_(0xB5FF61FF)                                 /* (SPI_IXS_STATUS) Register Mask  */


/* -------- SPI_IXS_BUF : (SPI_IXS Offset: 0x28) (R/W 32) SPI Buffer Register -------- */
#define SPI_IXS_BUF_RESETVALUE                _UINT32_(0x00)                                       /*  (SPI_IXS_BUF) SPI Buffer Register  Reset Value */

#define SPI_IXS_BUF_DATA_Pos                  _UINT32_(0)                                          /* (SPI_IXS_BUF) FIFO Data bits Position */
#define SPI_IXS_BUF_DATA_Msk                  (_UINT32_(0xFFFFFFFF) << SPI_IXS_BUF_DATA_Pos)       /* (SPI_IXS_BUF) FIFO Data bits Mask */
#define SPI_IXS_BUF_DATA(value)               (SPI_IXS_BUF_DATA_Msk & (_UINT32_(value) << SPI_IXS_BUF_DATA_Pos)) /* Assigment of value for DATA in the SPI_IXS_BUF register */
#define SPI_IXS_BUF_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (SPI_IXS_BUF) Register Mask  */


